Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དང་། བསྔགས་པ་འདི་དག་དང་ལྡན་ཞིང་ཏིང་ངེ་འཛིན་འདི་ལ་བརྟེན་ནས་སྤོབས་པ་རྒྱུན་མི་འཆད་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དང་བསྔགས་པ་ཡང་དག་པར་བསྟན་ན་དོན་དང་འབྲུ་ཡོངས་སུ་ཟད་པར་མི་འགྱུར་ཏེ། དེའི་ཚིག་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ།
en: “If bodhisattva mahāsattvas who possess these buddha qualities and their praise, and who have continuous confidence of speech based upon this samādhi, teach correctly the buddha qualities and praises of the Tathāgata, the arhat, the perfectly enlightened Buddha, there will be no loss of meaning or words and all their words will come forth as those of the Buddha.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་དེ་ཉིད་གསལ་བར་བྱ་བའི་ཕྱིར་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་རྒྱས་པར་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བཤད་དོ། །བསྐལ་པ་སྟོང་ཕྲག་མང་པོར་རབ་བཤད་ཀྱང་། །རྒྱལ་བའི་བསྔགས་པ་ཐམས་ཅད་བརྗོད་མི་སླ།
en: Then at that time the Bhagavān, in order to make the meaning clear, gave a detailed teaching by chanting the following extensive verses to the youth Candraprabha. “It would not be easy to recite all the praises of the jinas Even if one were to speak for many thousands of eons; And the jinas attained their qualities

source: །ཏིང་འཛིན་ཞི་མཆོག་འདི་ནི་ཚོལ་བའི་ཕྱིར། །རྒྱལ་བས་དེ་ལྟའི་ཡོན་ཏན་ཡང་དག་བསྒྲུབས།
en: Through seeking this supreme samādhi of peace. {1}

source: །ངས་ནི་ཏིང་འཛིན་ཞི་མཆོག་འདི་ཚོལ་བས། །སྔོན་ཚེ་ཞུམ་པ་མེད་པའི་ཡིད་ཀྱིས་སུ།
en: “In the past, when I sought this supreme samādhi of peace With a mind that was indefatigable,

source: །བུ་མོ་གཟུགས་བཟང་ཤིན་ཏུ་བལྟ་ན་སྡུག །ལེགས་པར་ལུས་བརྒྱན་ཡིད་དུ་འོང་བ་བྱིན།
en: I gave away a maiden adorned in jewelry, Who was perfectly beautiful and desirable. {2}

source: །དེ་བཞིན་བྲན་ཕོ་བྲན་མོ་ནོར་དང་འབྲུ།
en: I gave away male and female servants, riches and grain,

source: །དེ་བཞིན་ནོར་བུ་མུ་ཏིག་གསེར་དངུལ་བྱིན།
en: And also jewels, pearls, gold, and silver. {3}

source: །ངས་ནི་ཏིང་འཛིན་ཞི་མཆོག་འདི་ཚོལ་བས།
en: “When I sought this supreme samādhi of peace In the past, I gave to the guides

source: །ནོར་བུ་རིན་ཆེན་སྣ་ཚོགས་མུ་ཏིག་ཕྲེང་།
en: Various kinds of precious jewels, strings of pearls,

source: །གོས་དང་གདུ་བུ་གསེར་སྐུད་མཛེས་པ་དག །སྔོན་ཚེ་འདྲེན་པ་རྣམས་ལ་ངས་བཏང་བྱས།
en: Beautiful clothes, and necklaces of conch and gold. {4}

source: །བསྐལ་པ་བྱེ་བ་མཐའ་ཡས་དཔག་མེད་པར།
en: “In countless, endless millions of eons

source: །དྲི་མཆོག་དྲི་ལྡན་དབྱར་གྱི་མེ་ཏོག་དག །རབ་ཏུ་བླ་ན་མེད་པའི་སེམས་བསྐྱེད་ནས། རྒྱལ་བའི་མཆོད་རྟེན་དག་ལ་ང་ཡིས་ཕུལ།
en: I developed the highest supreme aspiration, And gave the best of perfumes and summer flowers

source: །འཁོར་གྱི་ནང་དུ་རི་མོ་བསྐྱེད་ནས་ཀྱང་།
en: To the caityas of the jinas. {5}

source: །དེ་བཞིན་ཆོས་ཀྱི་སྦྱིན་པ་ངས་བྱིན་ཏེ།
en: “Through my giving the gift of the Dharma I developed a pleasing following; But the thought did not arise in my mind

source: །ཆོས་ཀྱི་སྦྱིན་པ་བྱིན་པས་ང་གྲགས་སྙམ།
en: Of gaining renown through giving the gift of the Dharma. {6}

source: །ང་ལ་ནམ་ཡང་དེ་འདྲའི་སེམས་མ་སྐྱེས།
en: “I never felt any reluctance to give away

source: །སྡུག་པའི་མཆོག་བྱིན་བདག་ཉིད་སྤྱད་པར་ནི། །དེ་སྙམ་ཆགས་པ་ང་ལ་ཡོང་མ་བྱུང་།
en: The loveliest things that gave me pleasure.

source: །སྦྱིན་པའི་ཆོས་ནི་མང་དུ་ངས་བྱིན་ཏེ།
en: I gave the gift of Dharma numerous times,

source: །རྟག་ཏུ་སངས་རྒྱས་ཡེ་ཤེས་ངས་ཐོབ་སྙམ།
en: And always my thoughts were of attaining buddha wisdom. {7}

source: །སྦྱངས་པའི་ཡོན་ཏན་དག་ཀྱང་ངས་སྔོན་བསྒྲུབས།
en: “In the past, to attain the qualities of this training,

source: །ནགས་མཆོག་སྒྲ་ཉུང་རྟག་ཏུ་གནས་བྱས་ཏེ།
en: I remained always in excellent, quiet forests.

source: །ཐམས་ཅད་དུས་སུ་སྙིང་རྗེ་མང་བར་གྱུར།
en: I had immense compassion throughout that time

source: །བྱམས་ཤིང་འཇམ་ལ་འགེད་པའི་ངང་ཚུལ་ཅན།
en: “I had a distinct conduct that was gentle and sweet,

source: །ཐོས་པ་འཛིན་ཅིང་བཞིན་འཛུམ་ཚིག་ཀྱང་འཇམ།
en: A smiling face, the memory of what I had heard, and affectionate speech.

source: །ཤིན་ཏུ་ཚིག་སྙན་མང་པོ་ཀུན་ཀྱང་དགའ།
en: My very sweet words were beloved by many

source: །ང་ལ་སྐྱེ་བོ་ཀུན་ལྟ་ངོམས་མི་འགྱུར།
en: And all beings never had enough of looking at me. {9}

source: །སེར་སྣ་ཅན་དུ་སྐད་ཅིག་མ་གྱུར་ཏེ།
en: “I did not have any stinginess for even a moment.

source: །སྲིད་པ་མང་པོར་ནམ་ཡང་སེར་སྣ་མེད།
en: Throughout myriad existences I had no envy.

source: །རྟག་ཏུ་བསོད་སྙོམས་དག་ལ་ང་དགའ་སྟེ།
en: I was always completely satisfied by alms.

source: །མགྲོན་དུ་བོས་པ་ཐམས་ཅད་མ་ལུས་སྤངས།
en: I offered everything and left no remainder. {10}

source: །འདི་ལས་རྩ་བཞི་ཚིགས་བཅད་གཅིག་བཟུང་ན།
en: “Those who remember just one four-line verse from this

source: །མང་དུ་ཐོས་ཤིང་ཐོས་པ་འཛིན་པར་འགྱུར།
en: Become very learned and remember all they have heard.

source: །དེས་ནི་ང་ལ་བླ་ན་མེད་པ་ཡི། །དད་པའི་མཆོག་བསྐྱེད་རྟག་ཏུ་བཀུར་སྟི་བྱས།
en: Through it the highest, perfect faith arose in me And I always honored it. {11}

source: །ངས་ནི་ཏིང་འཛིན་ཞི་མཆོག་འདི་ཚོལ་ཕྱིར།
en: “I longed for the supreme peace of this samādhi

source: །རྣམ་པར་འདྲེན་ལ་མཆོད་པ་མང་པོ་བྱས།
en: And made many offerings to the guides.

source: །སྦྱིན་པ་རྣམ་པ་མང་པོ་མཐའ་ཡས་བྱིན།
en: I gave to them an endless variety of gifts

source: །དེ་བཞིན་ཚུལ་ཁྲིམས་དག་ཀྱང་ཡུན་རིང་བསྲུངས།
en: And this maintained my correct conduct for a long time. {12} “From remembering one verse from this samādhi The merit will be vastly greater

source: །འཇིག་རྟེན་ཁམས་ཡངས་སྣ་ཚོགས་མཐའ་ཡས་པ། །ནོར་བུ་རིན་ཆེན་བཀང་སྟེ་སྦྱིན་བྱིན་པས། །ཏིང་འཛིན་འདི་ལས་ཚིགས་བཅད་གཅིག་བཟུང་ན།
en: Than from endlessly offering numerous, various worlds That are all filled with precious jewels. {13}

source: །དེ་བས་བསོད་ནམས་འདི་ནི་རྒྱ་ཆེར་འཕགས།
en: “If those wishing for merit

source: །བསྐལ་པ་མཐའ་ཡས་དཔག་མེད་མང་པོར་ཡང་།
en: Were to offer to the jinas

source: །མེ་ཏོག་མང་པོ་ཇི་སྙེད་ཡོད་པ་དང་། །དེ་བཞིན་སྤོས་རྣམས་ཡིད་འོང་རྒྱ་ཆེ་བ།
en: Whatever flowers and incense exist

source: །བསོད་ནམས་འདོད་ཕྱིར་རྒྱལ་བ་མཆོད་པ་དང་། །བསྐལ་པ་མཐའ་ཡས་དཔག་མེད་མང་པོར་ནི།
en: For numerous, countless, endless eons, {14} “And if those wishing for merit Were to offer to the jinas

source: །སིལ་སྙན་མང་པོ་ཇི་སྙེད་ཡོད་པ་དང་། །དེ་བཞིན་སྣང་གསལ་ཞལ་ཟས་ན་བཟའ་ཡིས།
en: Every kind of music, light, food, and clothing For numerous, countless, endless eons, {15}

source: །བསོད་ནམས་འདོད་ཕྱིར་རྒྱལ་བ་མཆོད་པ་བས།
en: “A person who develops the aspiration to enlightenment,

source: །རང་བྱུང་རྒྱལ་བ་ཆོས་རྗེར་བདག་གྱུར་ཅེས། །མི་གང་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་ནས། །མཉམ་པར་གཞག་པས་ཚིགས་བཅད་གཅིག་བཟུང་ན།
en: Wishing to become a self-arisen jina, a lord of Dharma,

source: །དེ་བས་བསོད་ནམས་འདི་ནི་རྒྱ་ཆེར་འཕགས། །གང་གཱའི་བྱེ་མ་མང་པོ་ཇི་སྙེད་པ། །བསྐལ་པ་དེ་སྙེད་དུ་ཡང་ཕན་ཡོན་རྣམས།
en: Will have merit that will be vastly greater

source: །བརྗོད་ཀྱང་ཡོངས་སུ་ཟད་པར་མི་ནུས་ཏེ། །ཏིང་འཛིན་འདི་བཟུང་བསོད་ནམས་ཤིན་ཏུ་ཆེ།
en: Through remembering one verse of this meditation. {16} “The merit from possessing this samādhi is most vast. One would not be able to conclude reciting The description of its benefits even in as many eons As there are grains of sand in the Ganges. {17}

source: །དེ་ཕྱིར་སངས་རྒྱས་ཕན་ཡོན་དག །ཤིན་ཏུ་བཟང་པོ་འདི་ཐོས་ནས། །སངས་རྒྱས་བསྔགས་པའི་ཏིང་འཛིན་འདི། །མྱུར་དུ་ལུང་ཡང་མནོད་པར་གྱིས།
en: “Therefore, having listened to The excellent benefits of the buddhas, You should quickly be one who has the transmission Of this samādhi praised by the Buddha. {18} “In my past lives I have honored

source: །སངས་རྒྱས་བྱེ་བ་བདུན་ཅུ་གསུམ། །སྔོན་གྱི་སྐྱེ་བར་བཀུར་སྟི་བྱས།
en: Seven hundred and thirty million buddhas.

source: །སངས་རྒྱས་དེ་དག་ཐམས་ཅད་ཀྱིས།
en: All of those buddhas

source: །མདོ་སྡེ་འདི་ནི་རབ་ཏུ་བཤད།
en: Promulgated this sūtra. {19}

source: །མདོ་སྡེ་འདི་ཡི་མིང་ཡང་ནི།
en: “The name of this sūtra

source: །སྙིང་རྗེ་ཆེན་པོར་འཇུག་ཅེས་བྱ། །འདི་ལ་མང་དུ་ཐོས་བསླབས་ན།
en: Is Entering Great Compassion.

source: །སངས་རྒྱས་ཆོས་ནི་རྙེད་མི་དཀའ།
en: Buddha qualities will not be hard to attain For the learned one who trains in it. {20}

source: །འཇིག་རྟེན་འདྲེན་པ་མྱ་ངན་འདས།
en: “When the World’s Guide is in nirvāṇa,

source: །ཕྱི་མའི་དུས་ན་དགེ་སློང་ནི།
en: In that future time there will be

source: །སྡོམ་པ་མེད་པ་མང་པོ་དག །མང་དུ་ཐོས་པ་མི་འདོད་འབྱུང་།
en: Many undisciplined bhikṣus Who have no interest in becoming learned. {21}

source: །ཚུལ་ཁྲིམས་བསྔགས་པ་རྗོད་བྱེད་ལ།
en: “They will utter praises of correct conduct

source: །ཚུལ་ཁྲིམས་དོན་དུ་གཉེར་བ་མེད།
en: But will have no interest in correct conduct.

source: །ཏིང་འཛིན་བསྔགས་པ་རྗོད་བྱེད་ལ།
en: They will utter praises of samādhi

source: །ཏིང་འཛིན་དོན་དུ་གཉེར་བ་མེད།
en: But will have no interest in samādhi. {22}

source: །ཤེས་རབ་བསྔགས་པ་རྗོད་བྱེད་ལ།
en: “They will utter praises of wisdom

source: །ཤེས་རབ་དོན་དུ་གཉེར་བ་མེད།
en: But will have no interest in wisdom.

source: །རྣམ་གྲོལ་བསྔགས་པ་རྗོད་བྱེད་ལ།
en: They will utter praises of liberation

source: །རྣམ་གྲོལ་དོན་དུ་གཉེར་བ་མེད།
en: But will have no interest in liberation. {23}

source: །ཇི་ལྟར་སྐྱེས་བུ་ལ་ལ་དག །ཙན་དན་དག་ནི་འདི་འདྲ་སྟེ། །སྤོས་ཀྱི་རྣམ་པ་ཡིད་འོང་ཞེས། །ཙན་དན་དག་གི་ཡོན་ཏན་བརྗོད།
en: “It is like when someone Speaks of the qualities of sandalwood, Saying, ‘Sandalwood is like this, It makes a pleasing incense.’ {24}

source: །དེ་ནས་མི་གཞན་ལ་ལ་ཡིས།
en: “Then another person asks

source: །དེ་ལྟར་བསྔགས་པ་བརྗོད་པ་ཡི།
en: That man this question:

source: །ཙན་དན་ཆུང་ཟད་སྲེལ་ཏམ་ཞེས།
en: ‘Do you have some of the sandalwood

source: །སྐྱེས་བུ་ལ་ལས་དེ་དྲིས་ན།
en: That you have been praising?’ {25}

source: །སྐྱེས་བུ་དེ་ལ་སླར་སྨྲས་པ། །གང་གིས་འཚོ་བར་བྱེད་པ་ཡི།
en: “The man answers him,

source: །སྤོས་ཀྱི་བསྔགས་པ་ང་བརྗོད་པ།
en: ‘I speak the praises of that incense And in that way make my living,

source: །སྤོས་དེ་ང་ལ་མེད་ཅེས་སྨྲ།
en: But I have never seen that incense.’ {26}

source: །དེ་བཞིན་རྣལ་འབྱོར་མི་བརྩོན་པ། །ཚུལ་ཁྲིམས་བསྔགས་པས་འཚོ་བ་དག །ཕྱི་མའི་དུས་ལ་འབྱུང་འགྱུར་ཏེ།
en: “In such a way, in future times

source: །དེ་དག་ལ་ནི་ཚུལ་ཁྲིམས་མེད།
en: There will be those who have no correct conduct,

source: །དེ་བཞིན་རྣལ་འབྱོར་མི་བརྩོན་པ།
en: Yet they who do not engage in it

source: །ཏིང་འཛིན་བསྔགས་པས་འཚོ་བ་དག །ཕྱི་མའི་དུས་ལ་འབྱུང་འགྱུར་ཏེ།
en: Will make their living by praising it. {27} “In that way, in future times

source: །དེ་དག་ལ་ནི་ཏིང་འཛིན་མེད།
en: There will be those who have no samādhi,

source: །ཤེས་རབ་བསྔགས་པས་འཚོ་བ་དག །ཕྱི་མའི་དུས་ལ་འབྱུང་འགྱུར་ཏེ།
en: Will make their living by praising it. {28} “In that way, in future times

source: །དེ་དག་ལ་ནི་ཤེས་རབ་མེད།
en: There will be those who have no wisdom,

source: །རྣམ་གྲོལ་བསྔགས་པས་འཚོ་བ་དག །ཕྱི་མའི་དུས་ལ་འབྱུང་འགྱུར་ཏེ། །དེ་དག་ལ་ནི་རྣམ་གྲོལ་མེད།
en: Will make their living by praising it. {29} “In that way, in future times There will be those who have no liberation, Yet they who do not engage in it Will make their living by praising it. {30}

source: །ཇི་ལྟར་སྐྱེས་བུ་དབུལ་པོ་ལ་ལ་ཞིག །སྐྱེ་བོ་མང་པོས་ཡོངས་སུ་བརྙས་གྱུར་ལ།
en: “When a certain poor person, Despised by the populace,

source: །དེ་ཡིས་ཕྱིས་གདོད་ནོར་གྱི་གཏེར་རྙེད་ནས།
en: Later finds a treasure

source: །ནོར་ཡོད་རིག་པས་སྐྱེ་བོ་རི་མོར་བྱེད།
en: And becomes rich, he is respected by the people. {31}

source: །དེ་བཞིན་ཏིང་འཛིན་འདི་ནི་མ་ཐོབ་ན།
en: “In that same way, not having attained the samādhi,

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ཡང་ལྷ་མི་དང་། །གྲུལ་བུམ་སྲིན་པོ་མང་པོས་མི་བཀུར་ཏེ།
en: A bodhisattva is not esteemed By gods or humans, kumbhāṇḍas or rākṣasas,

source: །ཇི་ལྟར་སྐྱེས་བུ་དབུལ་པོ་ནོར་མེད་བཞིན།
en: Just like the poor person who has no wealth. {32} “Yet when the wise one attains the level

source: །མཁས་པས་གཞལ་དུ་མེད་པའི་ཆོས་ཀྱི་གཏེར། །ས་འདི་ནམ་ཞིག་རབ་ཏུ་ཐོབ་གྱུར་ན།
en: Of the unfathomable Dharma treasure,

source: །ལྷ་དང་མི་དག་དེ་ལ་རེ་བ་སྐྱེད།
en: Gods and humans will be attracted to him,

source: །དེས་ཀྱང་སྐྱེ་དགུ་བླ་མེད་ནོར་རྣམས་བྱིན།
en: And he will give those beings the supreme wealth. {33}

source: །དེ་ཕྱིར་རྒྱལ་བ་དག་གིས་བརྗོད་པ་ཡི། །ཕན་ཡོན་དམ་པ་བཟང་པོ་འདི་ཐོས་ནས།
en: “Therefore, having heard the Jina’s description Of the perfect attainment of those benefits,

source: །ཤེས་ཀྱི་ཁེ་དང་བདེ་རྙེད་ཀུན་སྤངས་ཏེ།
en: Forsake all happiness gained through reputation

source: །ཏིང་འཛིན་ཞི་མཆོག་འདི་ནི་ལུང་ནོད་གྱིས།
en: And hold the transmission of this supreme peace of samādhi. {34}

source: །སངས་རྒྱས་སུ་དག་ཕྱོགས་སུ་མྱ་ངན་འདས།
en: “The buddhas in all directions who have passed away,

source: །གང་དག་ད་ལྟར་བྱུང་དང་མ་འོངས་པ།
en: And those of the future, and those who are present,

source: །དེ་དག་ཐམས་ཅད་ཏིང་འཛིན་འདི་བསླབས་ནས། །བྱང་ཆུབ་བསམ་ཡས་མཚུངས་མེད་རྣམ་སངས་རྒྱས།
en: All attain unequaled, inconceivable enlightenment Through having trained in this samādhi.” {35}

source: །ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་སེམས་དགའ་ནས།
en: The youth Candraprabha was overjoyed,

source: །སངས་རྒྱས་སྤྱན་སྔར་འདུག་སྟེ་ཚིག་སྨྲས་པ།
en: And in the presence of the Buddha he said these words:

source: །སྐྱེས་བུ་དམ་པ་མྱ་ངན་ཡོངས་འདས་ནས།
en: “When the best of beings has passed into nirvāṇa,

source: །མ་རུངས་དུས་ན་བདག་གིས་མདོ་འདི་གཟུང་།
en: I will uphold this sūtra in that very difficult time. {36}

source: །བདག་གིས་ལུས་དང་སྲོག་ཀྱང་ཡོངས་བཏང་སྟེ།
en: “I will give up my body and my life

source: །འཇིག་རྟེན་སྐྱེད་པ་ཅི་མཆིས་ཀུན་བཏང་ལ།
en: And whatever happiness there is in the world;

source: །བདག་གིས་འཇིགས་པ་ཆེན་པོའི་དུས་དེར་ཡང་།
en: In that time of great terrors

source: །ཏིང་འཛིན་ཞི་མཆོག་འདི་ནི་གཟུང་བར་བགྱི།
en: I will hold this samādhi of supreme peace. {37}

source: །སེམས་ཅན་མང་ལ་སྙིང་རྗེ་ཆེར་སྐྱེད་དེ།
en: “I will have compassion for many beings.

source: །སེམས་ཅན་སྡུག་བསྔལ་མགོན་མེད་མཐོང་ནས་ཀྱང་།
en: I will see beings suffering without a protector.

source: །དེ་དག་ལ་ནི་བྱམས་པ་ཉེར་སྦྱར་ཞིང་།
en: I will be endowed with love for them

source: །དེ་ཡི་ཚེ་ན་ཏིང་འཛིན་འཛིན་པ་དག །ལྔ་བརྒྱ་ལས་ནི་མི་ཉུང་དེར་བྱུང་སྟེ།
en: At that time, no less than five hundred people Became holders of the samādhi. The youth was their leader

source: །མདོ་སྡེ་མཆོག་འདི་རྒྱ་ཆེར་གཟུང་བ་ལ། །དེ་དག་སྔོན་དུ་འདྲེན་པ་གཞོན་ནུ་ཡིན།
en: In this vast holding of the supreme sūtra. {39}

source: །སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཡང་དག་པར་བསྔགས་པའི་ལེའུ་སྟེ་གསུམ་པའོ།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ། བམ་པོ་གཉིས་པ།
en: Conclusion of the third chapter, “Praise of the Buddha’s Qualities.” Samādhi Chapter 4

source: དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། །བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the youth Candraprabha rose from his seat, removed his robe from one shoulder, and, kneeling on his right knee with palms placed together, he bowed toward the Bhagavān and made this request:

source: །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན་བདག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཕྱོགས་འགའ་ཞིག་ཞུའོ།
en: “If the Bhagavān will give me an opportunity to seek answers to them, I have a few questions for the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གཞོན་ནུ་ཁྱོད་ལ་དེ་བཞིན་གཤེགས་པས་རྟག་ཏུ་སྐབས་ཕྱེས།
en: The Bhagavān addressed the youth Candraprabha, saying, “Young man, the Tathāgata will always give you that opportunity.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག །དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་སྐབས་ཕྱེ་བ་དང་། བཅོམ་ལྡན་འདས་ལ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Ask whatever question you wish of the Tathāgata, the arhat, the perfectly enlightened Buddha.”

source: །བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་ཏིང་ངེ་འཛིན་ཅེས་བགྱི་བ་དེ་ཆོས་གང་གི་ཚིག་བླ་དགས་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གཞོན་ནུ་ཏིང་ངེ་འཛིན་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། སེམས་ངེས་པར་རྟོགས་པ་དང་། སྐྱེ་བ་མེད་པ་དང་མཚམས་སྦྱོར་བ་མེད་པ་དང་མཚམས་སྦྱོར་བ་ཤེས་པ་དང་ཁུར་བོར་བ་དང་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དང་སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་ཏུ་གྱུར་པ་དང་། འདོད་ཆགས་གསོ་བ་དང་ཞེ་སྡང་ཉེ་བར་ཞི་བ་དང་གཏི་མུག་བསལ་བ་དང་རིགས་པར་རྣལ་འབྱོར་དུ་བྱེད་པ་དང་། མི་རིགས་པ་རྣམ་པར་སྤོང་བ་དང་དགེ་བའི་ཆོས་ལ་འདུན་པ་དང་འཁོར་བ་ལས་ཐར་བར་འདོད་པ་དང་ལྷག་པའི་བསམ་པས་སྒྲུབ་པ་དང་། མི་ཉལ་བ་ལ་སྟེན་པ་དང་སྤོང་བ་མི་གཏོང་བ་དང་ཆོས་དཀར་པོ་རྣམས་ཡོངས་སུ་སྲུང་བ་དང་སྐྱེ་བོ་རྣམས་ལ་ཡིད་མི་རྟོན་པ་དང་ལས་རྣམས་ལ་མངོན་པར་འདུ་མི་བྱེད་པ་དང་ནང་གི་སྐྱེ་མཆེད་རྣམས་ཡིད་ལ་མི་བྱེད་པ་དང་། ཕྱིའི་སྐྱེ་མཆེད་རྣམས་ལ་ཀུན་ཏུ་མི་སྤྱོད་པ་དང་བདག་ལ་མི་སྟོད་པ་དང་གཞན་ལ་མི་སྨོད་པ་དང་ཁྱིམ་ལ་ཆགས་པ་མེད་པ་དང་སོ་སོའི་སྐྱེ་བོ་ལ་ཡིད་མི་རྟོན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་རྒྱུ་འཐུན་པ་དང་བསྙེན་པར་དཀའ་བ་དང་གཟི་ཆེན་པོ་དང་བདག་ཤེས་པ་དང་མི་རྒོད་པ་དང་སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པར་གནས་པ་དང་གནོད་སེམས་མེད་པ་དང་མི་རྩུབ་པ་དང་གཞན་ལ་མི་གནོད་པ་དང་། བཤེས་གཉེན་རྣམས་ལ་རྗེས་སུ་སྲུང་བ་དང་གསང་བའི་སྔགས་ཀུན་སྲུང་བ་དང་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ལ་རྣམ་པར་མི་འཚེ་ཞིང་གནོད་པ་མེད་པ་དང་འཇམ་པོར་སྨྲ་བ་དང་ཁམས་གསུམ་ཐམས་ཅད་ལ་མི་གནས་པ་དང་ཆོས་ཐམས་ཅད་ལ་སྟོང་པ་ཉིད་ཀྱི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་དང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ཤིན་ཏུ་འདུན་པ་ནི་གཞོན་ནུ་ཏིང་ངེ་འཛིན་ཅེས་བྱ་སྟེ། གཞོན་ནུ་གང་དེ་ལྟ་བུའི་ཆོས་དེ་དག་ལ་སྒྲུབ་པར་བྱེད་ཀྱི་ལོག་པར་སྒྲུབ་པར་མི་བྱེད་པ་འདི་ནི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: As the Bhagavān had given him the opportunity, the young man Candraprabha asked the Bhagavān, “The Bhagavān says, ‘samādhi, samādhi.’ What kind of Dharma does this word designate?” The Bhagavān replied to Candraprabha, “Young man, when I say ‘samādhi, samādhi,’ it means the profound realization of the mind. “[1] It is the absence of arising. [2] It is the absence of continuation. [3] It is the knowledge of continuation. [4] It is putting down the burden. [5] It is the wisdom of the tathāgatas. [6] It is having the preeminence of a buddha. [7]

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་ཉིད་སྟོན་ཅིང་དེའི་ཚེ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་རྒྱས་པར་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: It is the healing of desire, the pacifying of anger, and the elimination of ignorance. “[8] It is engaging in what should be engaged in. [9] It is rejecting that which should not be engaged in. [10] It is the aspiration to good qualities. [11] It is the wish to be free from saṃsāra. “[12] It is practicing with a higher motivation. [13] It is remaining awake. [14] It is not abandoning renunciation. [15] It is maintaining good qualities. “[16] It is not relying on rebirth. [17] It is not accumulating karma. [18] It is not paying attention to the internal āyatanas. [19] It is not engaging with the external āyatanas. “[20] It is not praising oneself. [21] It is not criticizing others. [22] It is having no attachment to family. [23] It is not placing one’s trust in ordinary people. “[24] It is the natural result of correct conduct. [25] It is that which is difficult to approach. [26] It is great majesty. [27] It is self-knowledge. “[28] It is the absence of inconstancy. [29] It is maintaining perfect behavior. [30] It is the absence of malice. [31] It is the absence of aggression. [32] It is not harming others. [33] It is taking care of companions. [34] It is guarding secret mantras. “[35] It is being nonviolent. [36] It is not being harmful to those with correct conduct. [37] It is speaking gently. “[38] It is not remaining anywhere in the three realms. [39] It is the patience that accords with the emptiness of all phenomena. [40] It is the aspiration to omniscient wisdom. “That, young man, is what is meant by ‘samādhi.’ Young man, practicing those qualities and not practicing their opposite is what is meant by ‘samādhi.’ ” Then the Bhagavān taught the samādhi, the revealed equality of the nature of all phenomena, and at that time gave a detailed teaching by chanting the following extensive verses to the youth Candraprabha.

source: །ངས་ནི་བདུད་རྩིའི་སྒོ་ཡང་རབ་ཏུ་ཕྱེ།
en: “I have opened the door to the elixir.

source: །ཆོས་ཀྱི་རང་བཞིན་ཅི་འདྲ་དེ་བཞིན་བཤད།
en: I have explained what the nature of phenomena is.

source: །སྐྱེ་བ་དག་ཀྱང་ཅི་འདྲ་ངས་བསྟན་ཏེ།
en: I have taught what births are.

source: །མྱ་ངན་འདས་པ་ཕན་ཡོན་བཅས་པ་བཤད།
en: I have explained nirvāṇa and its benefits. {1}

source: །སྡིག་པའི་གྲོགས་པོ་རྟག་ཏུ་རྣམ་པར་སྤང་།
en: “Always avoid sinful companions,

source: །དགེ་བའི་བཤེས་གཉེན་ལ་ཡང་བསྙེན་པར་བྱ།
en: Be in the company of good companions,

source: །འདུ་བ་སྤངས་ཏེ་ནགས་ཁྲོད་གནས་བཅའ་ཞིང་།
en: Dwell in the forest, avoiding crowds,

source: །བྱམས་པའི་སེམས་ནི་རྟག་ཏུ་བསྒོམ་པར་བྱ།
en: And always meditate with a loving mind. {2}

source: །ཚུལ་ཁྲིམས་དག་པ་རྟག་ཏུ་བསྲུང་བྱས་ཏེ།
en: “Always protect pure conduct,

source: །སྦྱངས་ལ་དགའ་བའང་རྟག་ཏུ་ཐོབ་པར་བྱ།
en: Gain the prosperity of renunciation,

source: །གཏོང་བ་དང་ནི་ཤེས་རབ་བསྙེན་བྱས་ན།
en: Be familiar with generosity and wisdom,

source: །ཏིང་འཛིན་འདི་ནི་རྙེད་པར་དཀའ་མི་འགྱུར། །ཉན་ཐོས་མང་པོ་ཡི་ནི་ས་མིན་པ། །ཞི་བའི་ས་འདི་དག་ཀྱང་ཐོས་ནས་ནི།
en: And this samādhi will not be difficult to attain. {3} “This is not the level of the numerous śrāvakas. When you have attained this level of peace,

source: །བདེ་བར་གཤེགས་པའི་ཆོས་ལ་མངོན་སུམ་གྱུར།
en: You will have the direct perception of the Sugata’s Dharma

source: །སངས་རྒྱས་ཡོན་ཏན་བསམ་ཡས་ཐོབ་པར་འགྱུར།
en: And you will attain the inconceivable buddha qualities. {4}

source: །སྐྱེས་བུ་བློ་ལྡན་སྣོད་འགྱུར་མཐོང་ནས་ཀྱང་།
en: “When you see wise people who are worthy vessels,

source: །དེ་དག་བྱང་ཆུབ་སེམས་ལ་ཡང་དག་ཆུད།
en: Bring them to the aspiration for enlightenment,

source: །བླ་མེད་ཡེ་ཤེས་ལ་ནི་རབ་བཀོད་ན།
en: Establish them in the highest knowledge,

source: །ཏིང་འཛིན་རྒྱལ་པོ་འདི་ནི་རྙེད་མི་དཀའ། །ཡོངས་སུ་ཚོལ་དང་ཀུན་དུ་ལོངས་སྤྱོད་དང་། །ཁ་ཟས་རྒྱུ་འཐུན་དག་ནི་གང་གི་ཕྱིར། །ཕྲག་དོག་སྐྱེས་པ་དེ་ལ་རབ་ཏུ་རྟོགས། །ཏིང་འཛིན་འདི་ནི་རྙེད་པར་ཡོང་མི་དཀའ།
en: And then this king of samādhis will not be difficult to attain. {5} “This samādhi is not difficult to attain For those who understand the natural results That come to those who become envious of wealth And to those who seek and enjoy it. {6}

source: །ཏིང་འཛིན་རྒྱལ་པོ་སྟོང་པ་འདི་སྒོམ་པ།
en: “The meditation of this king of samādhis, emptiness,

source: །ཚུལ་ཁྲིམས་དག་པའི་མགོ་ལ་དེ་འདུག་སྟེ།
en: Is at the summit of pure conduct.

source: །ཆོས་རྣམས་རང་བཞིན་རྟག་ཏུ་མཉམ་བཞག་ན།
en: The continuous meditation on the nature of phenomena

source: །བྱིས་པ་མི་རིགས་བརྩོན་པས་མི་ཤེས་སོ།
en: Is unknown to the foolish who practice incorrectly. {7}

source: །སུ་དག་ཏིང་འཛིན་ཞི་བ་འདི་འདོད་པ།
en: “Those who long for this samādhi of peace

source: །དེ་ལ་ནམ་ཡང་འཇིགས་པའི་བློ་མི་འབྱུང་།
en: Will never have fear arise in their mind.

source: །རབ་ཏུ་ཞི་བའི་ས་འདི་བསྟེན་ནས་ནི།
en: Those who are on this level of peace

source: །མི་མཆོག་རྣམས་ཀྱང་རྟག་ཏུ་མཐོང་བར་འགྱུར།
en: Will always see the supreme men. {8}

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་བྱད་གང་དྲན་པ།
en: “Whoever brings to mind the image of the Tathāgata’s body,

source: །དེ་ནི་ཡིད་ཞི་དབང་པོ་ཞི་བར་འགྱུར།
en: Their senses will be at peace and their mind at peace.

source: །སེམས་ལ་འཁྲུལ་མེད་རྟག་ཏུ་མཉམ་པར་བཞག །ཐོས་དང་ཤེས་པ་དག་ནི་རྒྱ་མཚོ་བཞིན།
en: Their minds, free of error, will always be at rest. What they have heard and what they know will be like an ocean. {9}

source: །ཏིང་འཛིན་འདི་ལ་རབ་ཏུ་གནས་ནས་ནི།
en: “Remaining in this samādhi,

source: །བྱང་ཆུབ་སེམས་དཔའ་འཆག་སར་སུ་འཆགས་པ།
en: Wherever the bodhisattvas tread

source: །དེས་ནི་སངས་རྒྱས་བྱེ་བ་ཕྲག་སྟོང་དང་། །དེ་བས་ལྷག་པར་གང་གཱའི་བྱེ་སྙེད་མཐོང་།
en: They will see ten thousand million buddhas And even more, as numerous as the Ganges sands. {10} “Anyone aiming to take the measure

source: །སུ་དག་སངས་རྒྱས་ཆོས་ལ་ཚད་འཛིན་པ། །མི་དེའི་སེམས་ནི་ཤིན་ཏུ་མྱོས་པར་འགྱུར།
en: Of the Buddha’s Dharma will go insane.

source: །ཚད་ལས་འདས་པ་ལ་ནི་ཚད་གཟུང་མེད།
en: One cannot measure that which is immeasurable;

source: །འདྲེན་པ་ཡོན་ཏན་ཐམས་ཅད་བསམ་མི་ཁྱབ། །ཕྱོགས་བཅུ་དག་ན་སེམས་ཅན་སུ་ཡང་ནི།
en: The qualities of the guides in their entirety are inconceivable. {11} “There is no being in the ten directions
